"What is the crane availability at the port with the name 'Port Antonio'?",
        "What is the current availability of cranes at 'Port Antonio'?",
        "What is the crane availability at the port with the ID 'YENIS'?",
        "What is the current availability status of cranes at the port identified as 'YENIS'?",
        "How many ports have 'supplies water' available?",
        "How many ports provide access to water supplies?",
        "How many ports require 'pilotage advisory'?",
        "How many ports need 'pilotage advisory'?",
        "How many ports require 'pilotage compulsory'?",
        "How many ports mandate 'pilotage compulsory'?",
        "What is the size class of the port with the name 'Porto Di Lido-Venezia'?",
        "What is the classification of the port named 'Porto Di Lido-Venezia' in terms of its size class?",
        "How many ports have 'shelter class G'?",
        "How many ports are categorized as 'shelter class G'?",
        "How many airports are in the graph?",
        "What is the number of airports in the graph?",
        "What is the name of the port located at latitude 61.418333?",
        "What is the port's name at a latitude of 61.418333?",
        "What is the operating country of the port with the ID 'USETW'?",
        "What country is the operating country of the port that has the identification code 'USETW'?",
        "What is the US representative status of the port with the ID 'BRITJ'?",
        "What is the current status of the representative from the United States for the port identified as 'BRITJ'?",
        "How many ports have 'good holding ground'?",
        "How many ports have favorable holding conditions?",
        "What is the port's name that can be found at a latitude of 61.418333?",
        "What is the crane availability at the port with the ID 'JPFSK'?",
        "What is the level of crane accessibility currently at the port with the identifier 'JPFSK'?",
        "What is the current representation of the port identified as 'BRITJ' by the United States?",
        "What is the size of the dry dock at the port with the label 'Marstal'?",
        "What is the dimension of the dry dock located at the port called 'Marstal'?",
        "How many coastal ports are in the graph?",
        "How many ports located along the coast are present in the graph?",
        "What is the dimension of the dry dock located in the port named 'Marstal'?",
        "What is the repair class of the port with the ID 'YENIS'?",
        "What is the repair category of the port that has the identifier 'YENIS'?",
        "What is the crane availability at the port with the name 'Nuuk'?",
        "What is the current availability of cranes at the port called 'Nuuk'?",
        "How many ports offer supplies for 'provisions'?",
        "How many ports provide access to fuel oil supplies?",
        "What is the dimensions of the dry dock located at the port called 'Marstal'?",
        "What is the latitude of the airport with the ID 'KUF'?",
        "What is the latitude of the airport identified as 'KUF'?",
        "What is the shelter class of the port with the name 'Venice'?",
        "What is the shelter category of the port named 'Venice'?",
        "What is the class size of the port named 'Juneau'?",
        "How many ports offer water supplies?",
        "What is the current availability of cranes at the port with the identifier 'JPFSK'?",
        "How many ports possess a 'shelter class G'?",
        "How many ports have the availability of water supplies?",
        "What is the longitude of the port with the label 'Sept Iles (Seven Is.)'?",
        "What is the longitude of the port called 'Sept Iles (Seven Is.)'?",
        "What is the current status of the US representative for the port identified as 'BRITJ'?",
        "What is the latitude of the port labeled as 'AUDKB'?",
        "What is the index number of the port with 'Marine Railway Class M'?",
        "What is the index of the port that has the class 'Marine Railway Class M'?",
        "How many ports have favorable anchoring conditions?",
        "How many ports have a mandatory requirement for pilotage?",
        "What is the port called at latitude 61.418333?"